In [0]:
import pandas as pd
import numpy as np

In [0]:
df=pd.read_csv('In_DB - In_DB.csv')

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
Unnamed: 0          7 non-null int64
Retired             7 non-null object
Young               7 non-null object
Retiredrating       7 non-null int64
Youngrating         7 non-null int64
Retiredpayperday    7 non-null int64
dtypes: int64(4), object(2)
memory usage: 464.0+ bytes

**Import can be done using csv or by using dataframe**

**To see all the data in the cell using pandas**

In [0]:

df.loc[:]

   Unnamed: 0 Retired   Young  Retiredrating  Youngrating  Retiredpayperday
0           0     ram    yuva              5            4              1000
1           1    ravi  suresh              3            2               500
2           2     raj   mohan              1            4               600
3           3     taj   kumar              5            3               700
4           4  mukesh   kumar              1            4               900
5           5  tharun   kumar              5            1              1000
6           6   varun   kumar              3            5               400

**Compare Retired and young who take cares**

In [0]:
df = pd.read_csv('In_DB - In_DB.csv', usecols = [1,2])
df

  Retired   Young
0     ram    yuva
1    ravi  suresh
2     raj   mohan
3     taj   kumar
4  mukesh   kumar
5  tharun   kumar
6   varun   kumar

**Testing**

In [0]:

df = pd.read_csv('In_DB - In_DB.csv', usecols = ['Young','Retired'])
df

  Retired   Young
0     ram    yuva
1    ravi  suresh
2     raj   mohan
3     taj   kumar
4  mukesh   kumar
5  tharun   kumar
6   varun   kumar

**b. type the retired person name the person who take care will show**

In [0]:
df[df.Retired=='taj']

  Retired  Young
3     taj  kumar

**Testing**

In [0]:

df = pd.read_csv('In_DB - In_DB.csv', usecols = ['Young','Retired'])
df

  Retired   Young
0     ram    yuva
1    ravi  suresh
2     raj   mohan
3     taj   kumar
4  mukesh   kumar
5  tharun   kumar
6   varun   kumar

**a. Code  to type the young  person name the persons who he  take care of will show**

In [0]:
df[df.Young=='kumar']

  Retired  Young
3     taj  kumar
4  mukesh  kumar
5  tharun  kumar
6   varun  kumar

In [0]:
df = pd.read_csv('In_DB - In_DB.csv', usecols = ['Young','Retired'])
df

  Retired   Young
0     ram    yuva
1    ravi  suresh
2     raj   mohan
3     taj   kumar
4  mukesh   kumar
5  tharun   kumar
6   varun   kumar

**The pay given by retired per hour**

In [0]:
df = pd.read_csv('In_DB - In_DB.csv', usecols = ['Retired','Retiredpayperday'])
df

  Retired  Retiredpayperday
0     ram              1000
1    ravi               500
2     raj               600
3     taj               700
4  mukesh               900
5  tharun              1000
6   varun               400

**Retired and retired rating**

In [0]:
df = pd.read_csv('In_DB - In_DB.csv', usecols = ['Retired','Retiredrating'])
df

  Retired  Retiredrating
0     ram              5
1    ravi              3
2     raj              1
3     taj              5
4  mukesh              1
5  tharun              5
6   varun              3

**Young and young rating**

In [0]:
df = pd.read_csv('In_DB - In_DB.csv', usecols = ['Young','Youngrating'])
df

    Young  Youngrating
0    yuva            4
1  suresh            2
2   mohan            4
3   kumar            3
4   kumar            4
5   kumar            1
6   kumar            5

**Specific  person young rating**

In [0]:
df = pd.read_csv('In_DB - In_DB.csv', usecols = ['Young','Youngrating'])
df

    Young  Youngrating
0    yuva            4
1  suresh            2
2   mohan            4
3   kumar            3
4   kumar            4
5   kumar            1
6   kumar            5

In [0]:
df[df.Young=='kumar']

   Young  Youngrating
3  kumar            3
4  kumar            4
5  kumar            1
6  kumar            5

**Specific  person retired rating**

In [0]:
df = pd.read_csv('In_DB - In_DB.csv', usecols = ['Retired','Retiredrating'])
df

  Retired  Retiredrating
0     ram              5
1    ravi              3
2     raj              1
3     taj              5
4  mukesh              1
5  tharun              5
6   varun              3

In [0]:
df[df.Retired=='ram']

  Retired  Retiredrating
0     ram              5